Cinema/src/DataProcessors/ЗагрузкаГрафикаРелизов/ЗагрузкаГрафикаРелизов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаГрафикаРелизов</name>
</mdclass:DataProcessor>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/DataProcessors/ЗагрузкаГрафикаРелизов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикРелизовФильм.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.Фильм");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.Обновить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикРелизовФильм.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикРелизовФильмЦифровойРелиз.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикРелизовДатаРелиза.Имя);
	
	ГруппаОтбораИ = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.Фильм");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.ДатаРелиза");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.ЦифровойРелиз");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.ДатаРелиза");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикРелизов.ЦифровойРелиз");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтПолужирный);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекущийГод = Формат(ОбщийМодульВызовСервера.ДатаСеанса(), "ДФ=yyyy");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Фильтр               = "Файл (*.html)|*.html|Файл (*.htm)|*.htm";
	Описание             = Новый ОписаниеОповещения("ПослеВыбораФайлаХТМЛ", ЭтотОбъект);

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Показать(Описание);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикРелизов

&НаКлиенте
Процедура ГрафикРелизовФильмПриИзменении(Элемент)

	ТекТекущиеДанные = Элементы.ГрафикРелизов.ТекущиеДанные;
	ТекТекущиеДанные.ЦифровойРелиз = ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ТекТекущиеДанные.Фильм, "ЦифровойРелиз");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗагрузитьГрафикРелизов(Команда)

	ГрафикРелизов.Очистить();
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("html");
	
	Попытка
		Соединение	= Новый HTTPСоединение("www.kinopoisk.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		Ждать Соединение.ПолучитьАсинх("/lists/movies/coming-soon-digital/", ВременныйФайл);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ТекущийФайл  = Новый Файл(ВременныйФайл);
	ДокТекст     = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("ИмяФайла, ДокТекст", ТекущийФайл.Имя, ДокТекст);
	Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиЧтенияФайла", ЭтотОбъект);
	ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатыРелизов(Команда)
	
	ОбновитьДатыРелизовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ТекущийФайл  = Новый Файл(ИмяФайла);
	ДокТекст     = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("ИмяФайла, ДокТекст", ТекущийФайл.Имя, ДокТекст);
	Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиЧтенияФайла", ЭтотОбъект);
	ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриВозникновенииОшибкиЧтенияФайла(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Причина = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка открытия файла <%1>; по причине: <%2>.'"), ДополнительныеПараметры.ИмяФайла, Причина);;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	СоответствиеМесяцев = Новый Соответствие;
	СоответствиеМесяцев.Вставить("янв",  1);
	СоответствиеМесяцев.Вставить("фев",  2);
	СоответствиеМесяцев.Вставить("мар",  3);
	СоответствиеМесяцев.Вставить("апр",  4);
	СоответствиеМесяцев.Вставить("мая",  5);
	СоответствиеМесяцев.Вставить("июн",  6);
	СоответствиеМесяцев.Вставить("июл",  7);
	СоответствиеМесяцев.Вставить("авг",  8);
	СоответствиеМесяцев.Вставить("сен",  9);
	СоответствиеМесяцев.Вставить("окт", 10);
	СоответствиеМесяцев.Вставить("ноя", 11);
	СоответствиеМесяцев.Вставить("дек", 12);
	
	ДокТекст     = ДополнительныеПараметры.ДокТекст;
	СтраницаHTML = ДокТекст.ПолучитьТекст();
	НачалоФильма = ПолучитьТэгПоВхождению("<div class=""styles_root", СтраницаHTML);
	МассивСтрок  = Новый Массив;
	Вхождение    = СтрНайти(СтраницаHTML, НачалоФильма, НаправлениеПоиска.СКонца);
	
	Пока Вхождение > 0 Цикл
		
		Если ПустаяСтрока(НачалоФильма) Тогда
			Прервать;
		КонецЕсли;
		
		ТекСтрока    = Сред(СтраницаHTML, Вхождение);
		СтраницаHTML = СтрЗаменить(СтраницаHTML, ТекСтрока, "");
		НачалоФильма = ПолучитьТэгПоВхождению("<div class=""styles_root", СтраницаHTML);
		Вхождение    = СтрНайти(СтраницаHTML, НачалоФильма, НаправлениеПоиска.СКонца);
		
		Если СтрНайти(ТекСтрока, "styles_day") > 0 Тогда
			МассивСтрок.Добавить(ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;

	Для каждого ТекСтрока Из МассивСтрок Цикл
		
		ДеньРелиза  = ПолучитьЗначениеТэга("<div class=""styles_day", ТекСтрока);
		МесяцРелиза = ПолучитьЗначениеТэга("<div class=""styles_month", ТекСтрока);
		ГодРелиза   = ПолучитьЗначениеТэга("<div class=""styles_year", ТекСтрока);
		НаимРелиза  = ПолучитьЗначениеТэга("<span class=""styles_mainTitle", ТекСтрока);
		
		Если ПустаяСтрока(ДеньРелиза) ИЛИ ПустаяСтрока(МесяцРелиза)
			ИЛИ ПустаяСтрока(ГодРелиза) ИЛИ ПустаяСтрока(НаимРелиза)
		Тогда
			Продолжить;
		КонецЕсли;
		
		МесяцЧислом = СоответствиеМесяцев.Получить(МесяцРелиза);
		
		Если МесяцЧислом = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаРелиза = Дата(Число(ГодРелиза), МесяцЧислом, Число(ДеньРелиза));
		
		Если ЗначениеЗаполнено(ДатаРелиза) И НЕ ПустаяСтрока(НаимРелиза) Тогда
			НоваяСтрока = ГрафикРелизов.Добавить();
			НоваяСтрока.Наименование = НаимРелиза;
			НоваяСтрока.ДатаРелиза   = ДатаРелиза;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ГрафикРелизов.Количество() > 0 Тогда
		ДополнитьГрафикРелизовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьГрафикРелизовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРелизов.Наименование КАК Наименование,
		|	ГрафикРелизов.ДатаРелиза КАК ДатаРелиза
		|ПОМЕСТИТЬ ДанныеЗагрузки
		|ИЗ
		|	&ГрафикРелизов КАК ГрафикРелизов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ДанныеЗагрузки.ДатаРелиза) КАК ДатаМинимум,
		|	МАКСИМУМ(ДанныеЗагрузки.ДатаРелиза) КАК ДатаМаксимум
		|ИЗ
		|	ДанныеЗагрузки КАК ДанныеЗагрузки";
	Запрос.УстановитьПараметр("ГрафикРелизов", ГрафикРелизов.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТекДатаСеанса   = ТекущаяДатаСеанса();
		НачалоЭтогоГода = НачалоГода(ТекДатаСеанса);
		КонецЭтогоГода  = КонецГода(ТекДатаСеанса);
		
		Если КонецМесяца(Выборка.ДатаМаксимум) = КонецЭтогоГода
			И НачалоМесяца(Выборка.ДатаМинимум) = НачалоЭтогоГода
		Тогда
			// Есть декабрь, и январь, у которого год ошибочен
			Для каждого СтрокаГрафикаРелизов Из ГрафикРелизов Цикл
				Если НачалоМесяца(СтрокаГрафикаРелизов.ДатаРелиза) = НачалоЭтогоГода Тогда
					СтрокаГрафикаРелизов.ДатаРелиза = ДобавитьМесяц(СтрокаГрафикаРелизов.ДатаРелиза, 12);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРелизов.Наименование КАК Наименование,
		|	ГрафикРелизов.ДатаРелиза КАК ДатаРелиза
		|ПОМЕСТИТЬ ДанныеЗагрузки
		|ИЗ
		|	&ГрафикРелизов КАК ГрафикРелизов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ЦифровойРелиз КАК ЦифровойРелиз
		|ПОМЕСТИТЬ ДатыРелизовФильмов
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.ДатаВыхода >= ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -12)
		|	И Фильмы.Наименование В
		|			(ВЫБРАТЬ
		|				ДанныеЗагрузки.Наименование КАК Наименование
		|			ИЗ
		|				ДанныеЗагрузки КАК ДанныеЗагрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ДанныеЗагрузки.ДатаРелиза = ДатыРелизовФильмов.ЦифровойРелиз
		|			ТОГДА ЛОЖЬ
		|		КОГДА ДатыРелизовФильмов.ЦифровойРелиз ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Обновить,
		|	ДатыРелизовФильмов.Фильм КАК Фильм,
		|	ДатыРелизовФильмов.ЦифровойРелиз КАК ЦифровойРелиз,
		|	ДанныеЗагрузки.Наименование КАК Наименование,
		|	ДанныеЗагрузки.ДатаРелиза КАК ДатаРелиза
		|ПОМЕСТИТЬ ИтоговыеДанные
		|ИЗ
		|	ДанныеЗагрузки КАК ДанныеЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыРелизовФильмов КАК ДатыРелизовФильмов
		|		ПО ДанныеЗагрузки.Наименование = ДатыРелизовФильмов.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИтоговыеДанные.Обновить КАК Обновить,
		|	ИтоговыеДанные.Фильм КАК Фильм,
		|	ИтоговыеДанные.ЦифровойРелиз КАК ЦифровойРелиз,
		|	ИтоговыеДанные.Наименование КАК Наименование,
		|	ИтоговыеДанные.ДатаРелиза КАК ДатаРелиза
		|ИЗ
		|	ИтоговыеДанные КАК ИтоговыеДанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обновить УБЫВ,
		|	ДатаРелиза";
	
	Запрос.УстановитьПараметр("ТекДата", ОбщийМодульВызовСервера.ДатаСеанса());
	Запрос.УстановитьПараметр("ГрафикРелизов", ГрафикРелизов.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ГрафикРелизов.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ОбновитьДатыРелизовНаСервере()
	
	Для каждого СтрокаТабЧасти Из ГрафикРелизов Цикл
	
		Если НЕ СтрокаТабЧасти.Обновить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТабЧасти.Фильм) И ЗначениеЗаполнено(СтрокаТабЧасти.ДатаРелиза) Тогда
			
			СпрОбъект = СтрокаТабЧасти.Фильм.ПолучитьОбъект();
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.ЦифровойРелиз = СтрокаТабЧасти.ДатаРелиза;
			
			Попытка
			    СпрОбъект.Записать();
				СтрокаТабЧасти.ЦифровойРелиз = СтрокаТабЧасти.ДатаРелиза;
				СтрокаТабЧасти.Обновить = Ложь;
			Исключение
				Индекс = ГрафикРелизов.Индекс(СтрокаТабЧасти);
				Описание_Ошибки = ОписаниеОшибки();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка установки даты релиза <%1> фильму <%2>; по причине: <%3>.'"), СтрокаТабЧасти.ДатаРелиза, СтрокаТабЧасти.Фильм, Описание_Ошибки);
				Сообщение.Поле = "ГрафикРелизов[" + Индекс + "].Фильм";
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТэгПоВхождению(НачалоТэга, СтраницаHTML)
	
	Вхождение  = СтрНайти(СтраницаHTML, НачалоТэга, НаправлениеПоиска.СКонца);
	ТекущийТэг = "";
	
	Если Вхождение > 0 Тогда
		Окончание = СтрНайти(СтраницаHTML, ">", НаправлениеПоиска.СНачала, Вхождение);
		Если Окончание > Вхождение Тогда
			ТекущийТэг = Сред(СтраницаHTML, Вхождение, Окончание - Вхождение + 1);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ТекущийТэг;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗначениеТэга(НачалоТэга, СтрокаHTML)
	
	ЗначениеТэга = "";
	НачальныйТэг = ПолучитьТэгПоВхождению(НачалоТэга, СтрокаHTML);
	Вхождение    = СтрНайти(СтрокаHTML, НачальныйТэг, НаправлениеПоиска.СНачала);
	ДлинаТэга    = СтрДлина(НачальныйТэг);
	
	Если Вхождение > 0 Тогда
		Окончание = СтрНайти(СтрокаHTML, "<", НаправлениеПоиска.СНачала, Вхождение + ДлинаТэга);
		Если Окончание > Вхождение Тогда
			ЗначениеТэга = Сред(СтрокаHTML, Вхождение + ДлинаТэга, Окончание - (Вхождение + ДлинаТэга));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеТэга;

КонецФункции

&НаКлиенте
Процедура ПослеВыбораФайлаХТМЛ(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяФайла = ВыбранныеФайлы.Получить(0);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
